Revit 2027 API
ParameterTypeId.MepProfileTypeParam Property
 "Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepProfileTypeParam { get; }
Public Shared ReadOnly Property MepProfileTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepProfileTypeParam {
	ForgeTypeId^ get ();
}
static member MepProfileTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace